app/controllers/favorite_recipes_controller.rb

    def index
        favs = FavoriteRecipe.all
---
SELECT "favorite_recipes".* FROM "favorite_recipes"

    def show
        singleuserfavorite = FavoriteRecipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorite_recipes".* FROM "favorite_recipes" WHERE "favorite_recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
        fav = FavoriteRecipe.find_by(id: params[:id]) # or Spice.find(params[:id])
---
SELECT "favorite_recipes".* FROM "favorite_recipes" WHERE "favorite_recipes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]