app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["email", "test@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-02-28 18:28:11.398026"], ["updated_at", "2023-02-28 18:28:11.398026"]]
---
    def create
        new_user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        # bottom method only for if the user is logged in
        # --------------------------------------------------
        # if current_user
        #     user = User.find(params[:id])
        #     render json: user, status: :ok
        # end
        # --------------------------------------------------
        user = User.find(params[:id])